#include <iostream>
using namespace std;
int main() {
	setlocale(LC_ALL, "rus");
	//Дано целое число N и набор из N вещественных чисел. Вывести в том же порядке округленные значения всех чисел из данного набора (как целые числа), а также сумму всех округленных значений.
	//int i, N;
	//double a, S;
	//cin >> N;
	//S = 0;
	//for (i = 1; i <= N; i = i + 1) {
	//	setlocale(LC_ALL, "russin");
	//	cin >> a;
	//	cout << "округленное значение = " << round(a) << endl;
	//	S = S + round(a);
	//}
	//cout << "сумма = " << S << endl;
	//Series8. Дано целое число N и набор из N целых чисел. Вывести в том же порядке все четные числа из данного набора и количество K таких чисел.
	//int i, N, k, a;
	//cin >> N;
	//k = 0;
	//i = 1;
	//while (i <= N) {
	//	i = i + 1;
	//	cin >> a;
	//	if (a % 2 == 0) {
	//		k = k + 1;
	//		cout << "четое число = " << a << endl;
	//	}
	//}
	//cout << "колл-во четных чисел = " << k << endl;
	//Series9. Дано целое число N и набор из N целых чисел. Вывести в том же порядке номера всех нечетных чисел из данного набора и количество K таких чисел.
	//int i, N, k, a;
	//cin >> N;
	//k = 0;
	//i = 1;
	//while (i <= N) {
	//	i = i + 1;
	//	cin >> a;
	//	if (a % 2 != 0) {
	//		k = k + 1;
	//		cout << "нечетое число = " << a << endl;
	//	}
	//}
	//cout << "колл-во нечетных чисел = " << k << endl;
	//16. В бригаде, работающей на уборке сена, имеется N сенокосилок.Первая сенокосилка работала m часов, а каждая следующая на 10 минут больше, чем предыдущая.Сколько часов проработала вся бригада?		
	//int m, n, i;
	//cin >> n;
	//cin >> m;
	//i = 1;
	//m = m * 60;
	//while (i <= n) {
	//	m = m + 10;
	//	i = i + 1;
	//}
	//cout << m / 10 << " часов" << endl;
	//17. В ЭВМ вводятся по очереди данные о росте N учащихся класса. Определить средний рост учащихся класса.
	//int n, i;
	//double x, sr;
	//cout << "колл-во учиников = ";
	//cin >> n;
	//for (i = 1; i <= n; i = i + 1) {
	//	cout << "введите рост ", i, "ученика: ";
	//	cin >> x;
	//	sr = sr + x;
	//}
	//sr = sr / n;
	//cout << "средний рост = " << sr;
	//18. Задано натуральное число N. Найти количество натуральных чисел, не превосходящих N и не делящихся ни на одно из чисел 2,3,5.
	//int n, i, c = 0;
	//cout << "введите n = ";
	//i = 1;
	//cin >> n;
	//while (i <= n) {
	//	i = i + 0;
	//	if (i % 2 == 0 and i % 3 == 0 and i % 5 == 0) {
	//		c++;
	//		cout << c << endl;
	//	}
	//}
}